Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: Example returned values
pt_br: Para gerar um timestamp de uma string para representação de data, você deve estar capaz de usar strtotime().

source: am or pm
pt_br: Adicionalmente, alguns bancos de dados têm para converter suas datas em timestamps (tais como a função MySQL's UNIX_TIMESTAMP).

source: AM or PM
pt_br: Os seguintes caracteres são reconhecidos na estrutura da string:

source: Swatch Internet time
pt_br: a - "am" ou "pm "

source: d
pt_br: A - "AM" ou "PM "

source: 01 to 31
pt_br: B - Swatch Internet time

source: Mon through Sun
pt_br: d - dia do mês, 2 digitos com zeros zeros à esquerda; i.e. "01 "até "31"

source: A full textual representation of a month, such as January or March
pt_br: D - dia da semana, texto, 3 letras; e.g. "Fri "

source: g
pt_br: F - mês, texto, longo; e.g. "January "

source: 1 through 12
pt_br: g - hora, Forma com 12-horas sem zeros à esquerda; i.e. "1 "até "12"

source: 0 through 23
pt_br: G - hora, Forma com 24-horas sem zeros à esquerda; i.e. "0 "até "23"

source: 01 through 12
pt_br: h - hora, Forma com 12-horas; i.e. "01 "até "12"

source: 00 through 23
pt_br: H - hora, Forma com 24-horas; i.e. "00 "até "23"

source: 00 to 59
pt_br: i - minutos; i.e. "00 "até "59"

source: 1 if Daylight Savings Time, 0 otherwise.
pt_br: I (capital i) - "1 "Se no horário de verão, senão "0".

source: 1 to 31
pt_br: j - Dia do mês sem zeros à esquerda; i.e. "1 "até "31"

source: Sunday through Saturday
pt_br: l (minúscula 'L') - dia da semana, texo, longo; e.g. "Friday "

source: 1 if it is a leap year, 0 otherwise.
pt_br: L - booleano se é um ano bissexto; i.e. "0 "ou "1"

source: Jan through Dec
pt_br: M - mês, texto, 3 letras; e.g. "Jan "

source: Example: +0200
pt_br: O - Diferença entre o horário de Greenwich em horas; e.g. "+0200 "

source: Thu, 21 Dec 2000 16:01:07 +0200
pt_br: r - RFC 822 formatted date; e.g. "Thu, 21 Dec 2000 16:01:07 +0200 "(adicionda no PHP 4.0.4)

source: 00 through 59
pt_br: s - segundos; i.e. "00 "até "59"

source: st, nd, rd or th.
pt_br: S - Sufixo ordinal para o dia do mês, 2 characteres; i.e. "st", "nd", "rd "or "th"

source: 28 through 31
pt_br: t - número de dias do dado mês; i.e. "28 "até "31"

source: Examples:
pt_br: T - Timezone setting desta máquina; e.g. "EST "or "MDT"

source: See also time()
pt_br: U - segundos desde a época Unix (January 1 1970 00:00:00 GMT)

source: 0 (for Sunday) through 6 (for Saturday)
pt_br: w - dia da semana, numérico, i.e. "0" (domingo) até "6 "(Sábado)

source: ISO-8601 week number of year, weeks starting on Monday (added in PHP 4.1.0)
pt_br: W - ISO-8601 números de semanas do ano, semana começa na segunda-feira (adicionado no PHP 4.1.0)

source: 42 (the 42nd week in the year)
pt_br: Y - ano, 4 dígitos; e.g. "1999 "

source: A full numeric representation of a year, 4 digits
pt_br: y - ano, 2 dígitos; e.g. "99 "

source: 1999 or 2003
pt_br: z - dia do ano; i.e. "0 "até "365"

source: 0 through 366
pt_br: O offset para as timezones oeste de UTC é sempre negativa, e para as leste de UTC é sempre positiva.

source: Timezone offset in seconds.
pt_br: Exemplo 1. date() exemplo

source: -43200 through 43200
pt_br: echo date ("l dS of F Y h:i:s A"); echo "July 1, 2000 is on a ". date ("l", mktime(0,0,0,7,1,2000));

source: The Z format will always return 0 when using gmdate().
pt_br: Você pode prevenir um caracter conhecido no formato de string de um existente por escape com uma barra invertida precedendo-o.

source: ?php / / Prints something like:
pt_br: Se o caracter com a barra invertida já é uma sequência especial, você pode precisar também de escape para a barra invertida.

source: Wednesday echo date( "l"); / / Prints something like:
pt_br: Exemplo 2.

source: Wednesday 15th of January 2003 05:51:38 AM echo date ("l dS of F Y h:i:s A"); / / Prints:
pt_br: Caracteres de escape em date()

source: You can prevent a recognized character in the format string from being expanded by escaping it with a preceding backslash.
pt_br: echo date( "l \\t\h\e jS"); / / prints something like 'Saturday the 8th '

source: Example 2.
pt_br: é possível usar date() e mktime() juntos para encontrar datas no futuro ou no passado.

source: ?php / / prints something like:
pt_br: Exemplo 3. date() e mktime() exemplo

source: It is possible to use date() and mktime() together to find dates in the future or the past.
pt_br: $tomorrow = mktime (0,0,0,date("m") ,date("d")+1,date("Y")); $lastmonth = mktime (0,0,0,date("m")-1,date("d"), date("Y")); $nextyear = mktime (0,0,0,date("m"), date("d"), date("Y")+1);

source: Example 3. date() and mktime() example
pt_br: Nota:

source: This can be more reliable than simply adding or subtracting the number of seconds in a day or month to a timestamp because of daylight savings time.
pt_br: Alguns exemplos de date() Alguns exemplos de date() formatação.

source: Note that you should escape any other characters, as any which currently have a special meaning will produce undesirable results, and other characters may be assigned meaning in future PHP versions.
pt_br: Note que você poderia escapar qualquer outro caracter, qualquer um que correntemente tenha um significado especial produziria resultados indesejáveis, e outros caracteres poderiam assumir significados em futuras versões do PHP.

source: When escaping, be sure to use single quotes to prevent characters like \n from becoming newlines.
pt_br: Quando usar escape, certifique o uso de aspas simples para evitar caracteres como \n próprio para novas linhas.

source: Example 4. date() Formatting
pt_br: Exemplo 4. date() Formatação

source: March 10th, 2001, 5:16:18 pm $today = date( "F j, Y, g:i a"); / / March 10, 2001, 5:16 pm $today = date("m.d.y"); / / 03.10.01 $today = date("j, n, Y"); / / 10, 3, 2001 $today = date("Ymd"); / / 20010310 $today = date('h-i-s, j-m-y, it is w Day z '); / / 05-16-17, 10-03-01, 1631 1618 6 Fripm01 $today = date('\i\t \i\s \t\h\e jS \d\a\y .'); / / It is the 10th day. $today = date("D M j G:i:s T Y"); / / Sat Mar 10 15:16:08 MST 2001 $today = date('H:m:s \m \i\s\ \m\o\n\t\h'); / / 17:03:17 m is month $today = date("H:i:s"); / / 17:16:17?
pt_br: /* Today is March 10th, 2001, 5:16:18 pm * / $today = date( "F j, Y, g:i a"); / / March 10, 2001, 5:16 pm $today = date("m.d.y"); / / 03.10.01 $today = date("j, n, Y"); / / 10, 3, 2001 $today = date("Ymd"); / / 20010310 $today = date('h-i-s, j-m-y, it is w Day z '); / / 05-16-17, 10-03-01, 1631 1618 6 Fripm01 $today = date('\i\t \i\s \t\h\e jS \d\a\y .'); / / It is the 10th day. $today = date("D M j G:i:s T Y"); / / Sat Mar 10 15:16:08 MST 2001 $today = date('H:m:s \m \i\s\ \m\o\n\t\h'); / / 17:03:17 m is month $today = date("H:i:s"); / / 17:16:17

source: To format dates in other languages, you should use the setlocale() and strftime() functions.
pt_br: Para formatar datas em outras línguas, você usaria as funções setlocale() e strftime().

source: See also getlastmod(), gmdate(), mktime(), strftime() and time().
pt_br: Veja também getlastmod(), gmdate(), mktime(), strftime() e time().

source: Adds the data in the record to the database.
pt_br: Description

source: Marks record to be deleted from the database.
pt_br: Description

source: Returns the data from record in an array.
pt_br: Description

source: Returns the data from record in an associative array.
pt_br: Description

source: The flags correspond to those for the open() system call. (Typically 0 means read-only, 1 means write-only, and 2 means read and write.)
pt_br: Description

source: When safe mode is enabled, PHP checks whether the files or directories you are about to operate on have the same UID (owner) as the script that is being executed.
pt_br: Nota:

source: Getting the information on the command line
pt_br: Exemplo 1.

source: Deletes the value for key in the database.
pt_br: Description

source: Returns the first key in the database.
pt_br: Description

source: Adds the value to the database with the specified key.
pt_br: Description

source: Returns the next key after key.
pt_br: Description

source: (4.1.0 - 4.2.3 only)
pt_br: dbplus_add

source: Example 1. dbx_close() example
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: ?php $link = dbx_connect( DBX_MYSQL, "localhost", "db", "username", "password") or die ("Could not connect"); print("Connected successfully"); dbx_close($link);?
pt_br: Exemplo 1. dbx_close() example

source: Example 1. dbx_compare() example
pt_br: Exemplo 1. dbx_compare() example

source: Example 1. dbx_connect() example
pt_br: Exemplo 1. dbx_connect() example

source: Example 1. dbx_error() example
pt_br: Exemplo 1. dbx_error() example

source: Example 1. dbx_escape_string() example
pt_br: Exemplo 1. dbx_escape_string() example

source: Example 2. lists each field 's name and type
pt_br: Exemplo 2. lists each field 's name and type

source: Example 3. outputs the content of data property into HTML table
pt_br: Exemplo 3. outputs the content of data property into HTML table

source: Example 1. dbx_sort() example
pt_br: Exemplo 1. dbx_sort() example

source: Example 1. debug_backtrace() example
pt_br: Exemplo 1. debug_backtrace() example

source: (PHP 3)
pt_br: debugger_off

source: Disables the internal PHP debugger.
pt_br: Description

source: Returns a string containing a binary representation of the given number argument.
pt_br: Retorna uma string contendo a representação binária do parâmetro numero.

source: The largest number that can be converted is 4294967295 in decimal resulting to a string of 32 1 's.
pt_br: O maior número que pode ser convertido é 4294967295 em decimal, resultando em uma strings de 32 números 1.

source: See also: bindec().
pt_br: Veja também a função bindec().

source: Returns a string containing a hexadecimal representation of the given number Returns a string containing a hexadecimal representation of the given number argument.
pt_br: Retorna uma string contendo a representação hexadecimal do argumento numero.

source: The largest number that can be converted is 2147483647 in decimal resulting to "7fffffff".
pt_br: O maior número que pode ser convertido é 2147483647 em decimal, resultando em "7fffffff".

source: See also hexdec().
pt_br: Veja também hexdec().

source: Returns a string containing an octal representation of the given number argument.
pt_br: Retorna uma string contendo a representação octal do parâmetro numero.

source: The largest number that can be converted is 2147483647 in decimal resulting to "17777777777".
pt_br: O maior número que pode ser convertido é 2147483647 em decimal, resultando em "17777777777".

source: See also octdec().
pt_br: Veja também octdec().

source: Returns TRUE if the named constant given by name has been defined, FALSE otherwise.
pt_br: Retorna TRUE se a constante dada pelo parâmetro name já foi definida, em outro caso FALSE.

source: Checking Constants
pt_br: Conferindo Constantes

source: ?php if (defined("CONSTANT")) {/ / Note that it should be quoted echo CONSTANT; / /}?
pt_br: ?php if (defined("CONSTANT")) {/ /Note que deve estar entre aspas echo CONSTANT; / /}?

source: See also define(), constant(), get_defined_constants() and the section on Constants.
pt_br: Veja também define(), constant(), get_defined_constants() e a seção sobre Constants.

source: Defines a named constant.
pt_br: Descrição

source: See the section on constants for more details.
pt_br: Veja a seção sobre constantes para maiores detalhes.

source: The name of the constant is given by name; the value is given by value.
pt_br: O nome da constante é dado pelo parâmetro name; o valor é dado por value.

source: The optional third parameter case_insensitive is also available.
pt_br: O terceiro parâmetro, que é opcional, case_insensitive também esta disponível.

source: If the value TRUE is given, then the constant will be defined case-insensitive.
pt_br: Se é dado o valor TRUE, então a constante será definida como case-insensitive.

source: The default behaviour is case-sensitive; i.e.
pt_br: O padrão é case-sensitive; ex.

source: CONSTANT and Constant represent different values.
pt_br: CONSTANTE e Constante representam valores diferentes.

source: ?php define ("CONSTANT", "Hello world ."); echo CONSTANT; / / outputs "Hello world. "echo Constant; / / outputs "Constant" and issues a notice. define ("GREETING", "Hello you .",TRUE); echo GREETING; / / outputs "Hello you. "echo Greeting; / / outputs "Hello you."?
pt_br: ?php define ("CONSTANTE", "Alô Mundo ."); echo CONSTANTE; / / mostra "Alô Mundo. "echo Constante; / / mostra "Constante" e dá um aviso. define ("GREETING", "Alô Você .",TRUE); echo GREETING; / / mostra "Alô você. "echo Greeting; / / mostra "Alô você."?

source: See also defined(), constant() and the section on Constants.
pt_br: Vejá também defined(), constant() e a seção sobre Constantes.

source: This function converts number from degrees to the radian equivalent.
pt_br: Esta função converte numero de graus ao equivalente em radianos.

source: See also rad2deg().
pt_br: Veja também rad2deg().

source: This is a dummy manual entry to satisfy those people who are looking for unlink() or unset() in the wrong place.
pt_br: Esta é uma seção falsa do manual, criada para satisfazer as pessoas que estão procurando por unlink() ou unset() no lugar errado.

source: See also: unlink() to delete files, unset() to delete variables.
pt_br: Veja também: unlink() para deletar arquivos, unset() para apagar váriaveis.

source: This function is an alias of exit().
pt_br: Esta função é um apelido para exit().

source: Given a string containing a path to a file, this function will return the name of the directory.
pt_br: Dada uma string contendo um caminho para um arquivo, esta função irá retornar o nome do diretório.

source: Example 1. dirname() example
pt_br: Exemplo 1. exemplo do dirname()

source: $path = "/ etc / passwd"; $file = dirname ($path); / / $file is set to" / etc "
pt_br: $path = "/ etc / passwd"; $file = dirname ($path); / / $file =" / etc "

source: In PHP 4.0.3, dirname() was fixed to be POSIX-compliant.
pt_br: A partir do PHP 4.0.3, dirname() foi modificada para ser conformante com o POSIX.

source: Essentially, this means that if there are no slashes in path, a dot ('.') is returned, indicating the current directory.
pt_br: Essencialemente, isto significa que se não há barras no path, um ponto ('.') é retornado, indicando o diretório atual.

source: Otherwise, the returned string is path with any trailing / component removed.
pt_br: Antes, a string retornada era o path com todos os / componente Antes, a string retornada era o path com todos os / componente removidos.

source: Note that this means that you will often get a slash or a dot back from dirname() in situations where the older functionality would have given you the empty string.
pt_br: Ou seja, você receberá uma barra ou ponto de dirname() em situações onde a funcionalidade anterior devolveria uma string vazia.

source: See also: basename(), pathinfo(), and realpath().
pt_br: Veja também: basename(), pathinfo() e realpath().

source: Given a string containing a directory, this function will return the number of bytes available on the corresponding filesystem or disk partition.
pt_br: Dado uma string contendo um diretório, esta função retornará o numero de bytes disponíveis no sistema de arquivos ou partição de disco.

source: Example 1. disk_free_space() example
pt_br: Exemplo 1. exemplo de disk_free_space()

source: $df = disk_free_space( "/ "); / / $df contains the number of bytes / / available on" / "
pt_br: $df = disk_free_space( "/ "); / / $df contém o número de bytes. / / disponível em" / "

source: This is a deprecated alias of disk_free_space().
pt_br: Este é um sinônimo obsoleto para a função disk_free_space().

source: Use that function instead.
pt_br: Ultilize aquela função ao invez.

source: Given a string containing a directory, this function will return the total number of bytes on the corresponding filesystem or disk partition.
pt_br: Dado uma string contendo um diretório, esta função retornará o numero total de bytes do sistema de arquivos ou a partição de disco.

source: Example 1. disk_total_space() example
pt_br: Exemplo 1. disk_total_space() example

source: $df = disk_total_space( "/ "); / / $df contains the total number of / / bytes available on" / "
pt_br: $df = disk_total_space( "/ "); / / $df contém o numero total de / / bytes disponíveis em" / "

source: (no version information, might be only in CVS)
pt_br: DomDocument - add_root [deprecated]

source: This function returns a new instance of class DomAttribute.
pt_br: Description

source: This function returns a new instance of class DomCData.
pt_br: Description

source: This function returns a new instance of class DomComment.
pt_br: Description

source: This function returns a new instance of class DomElement.
pt_br: Description

source: This function returns a new instance of class DomEntityReference.
pt_br: Description

source: This function returns a new instance of class DomText.
pt_br: Description

source: This function returns an object of class DomDocumentType.
pt_br: Description

source: This function returns the root element node of a document.
pt_br: Description

source: Creates an XML document from the dom representation.
pt_br: Description

source: Creates an HTML document from the dom representation.
pt_br: Description

source: This function returns the public id of the document type.
pt_br: Description

source: Retrieving the public id
pt_br: Exemplo 1.

source: Returns the system id of the document type.
pt_br: Description

source: Returns the attribute with name name of the current node.
pt_br: Description

source: Sets an attribute with name name ot the given value.
pt_br: Description

source: Setting an attribute
pt_br: Exemplo 1.

source: This functions appends a sibling to an existing node.
pt_br: Description

source: This function inserts the new node newnode right before the node refnode.
pt_br: Description

source: This function returns the document the current node belongs to.
pt_br: Description

source: This function returns the previous sibling of the current node.
pt_br: Description

source: This functions removes a child from a list of children.
pt_br: Description

source: (PHP 4.2) This function replaces the child oldnode with the passed new node.
pt_br: Description

source: (PHP 4.2) This function replaces an existing node with the passed new node.
pt_br: Description

source: Sets the namespace of a node to uri.
pt_br: Description

source: (PHP 4 = 4.2.1)
pt_br: domxml_new_doc

source: This function is an alias of floatval().
pt_br: doubleval - - Alias of floatval()

source: This alias is a left-over from a function-renaming.
pt_br: Nota:

source: Returns the current key and value pair from the array array and advances the array cursor.
pt_br: Retorna o par chave / valor corrente de array e avança o seu cursor.

source: This pair is returned in a four-element array, with the keys 0, 1, key, and value.
pt_br: Esse par é retornado num array de quatro elementos, com as chaves 0, 1, key, e value.

source: Elements 0 and key contain the key name of the array element, and 1 and value contain the data.
pt_br: Os elementos 0 e key contêm o nome da chave do elemento do array, e 1 e value contêm o valor.

source: If the internal pointer for the array points past the end of the array contents, each() returns FALSE.
pt_br: Se o cursor interno do array estiver apontando para além do final do array, each() retorna FALSE.

source: Example 1. each() examples
pt_br: Exemplos de each()

source: $bar now contains the following key / value pairs:
pt_br: $bar agora contém os seguintes pares de chaves e valores:

source: each() is typically used in conjunction with list() to traverse an array; for instance, $_POST:
pt_br: each() é tipicamente usada em conjunto com list() para percorrer um array; por exemplo, $_POST:

source: Traversing $_POST with each()
pt_br: Percorrendo $HTTP_POST_VARS usando each()

source: echo "Values submitted via POST method: br / \n"; reset ($_POST); while (list ($key, $val) = each ($_POST)) {echo "$key = $val br / \n";}
pt_br: echo "Valores submetidos pelo método POST: br"; reset ($_POST); while (list ($chave, $valor) = each ($_POST)) {echo "$chave = $valor br ";}

source: After each() has executed, the array cursor will be left on the next element of the array, or on the last element if it hits the end of the array.
pt_br: Depois da execução de each(), o cursor interno do array vai apontar para o prócimo elemento do array, ou no último elemento se ele chegar ao final do array.

source: You have to use reset() if you want to traverse the array again using each.
pt_br: Você deve usar reset() se quiser percorrer o array novamente.

source: See also key(), list(), current(), reset(), next(), prev(), and foreach.
pt_br: Veja também key(), list(), current(), reset(), next(), prev() e foreach.

source: Example 1. easter_date() example
pt_br: Exemplo 1. easter_date() example

source: Example 1. easter_days() example
pt_br: Exemplo 1. easter_days() example

source: ebcdic2ascii() is an Apache-specific function which is available only on EBCDIC based operating systems (OS / 390, BS2000).
pt_br: ebcdic2ascii() é uma função específica do Apache, somente disponível em sistemas operacionais baseados no EBCDIC (OS / 390, BS2000).

source: It translates the EBCDIC encoded string ebcdic_str to its equivalent ASCII representation (binary safe), and returns the result.
pt_br: Ela converte a string codificada em EBCDIC ebcdic_str em sua representação equivalente em ASCII (binary safe), retornando o resultado.

source: See also the reverse function ascii2ebcdic()
pt_br: Veja também a função inversa ascii2ebcdic()

source: Outputs all parameters.
pt_br: Descrição

source: echo() is not actually a function (it is a language construct) so you are not required to use parentheses with it.
pt_br: echo() não é uma função atualmente (construtor da linguagem) então não é obrigatório usar parênteses.

source: In fact, if you want to pass more than one parameter to echo, you must not enclose the parameters within parentheses.
pt_br: De fato, se você quer passar mais do que um parâmetro para echo, você não deve fechar os parênteses dentro de parênteses.

source: It is not possible to use echo() in a variable function context.
pt_br: Não é possível usar echo() num contexto de variable function, mas você pode usar print() no lugar dela.

source: Example 1. echo() examples
pt_br: Exemplo 1. echo() exemplos

source: echo() also has a shortcut syntax, where you can immediately follow the opening tag with an equals sign.
pt_br: echo() também tem uma sintaxe curta, onde você pode seguir imediatamente a tag de abertura com um sinal de igual.

source: This short syntax only works with the short_open_tag configuration setting enabled.
pt_br: Está sintaxe curta apenas trabalha se a configuração short_open_tag está habilitada.

source: See also print(), printf(), and flush().
pt_br: Veja também print(), printf(), e flush().

source: end() advances array's internal pointer to the last element, and returns that element.
pt_br: end() avança o ponteiro interno de array até o seu último elemento, e retorna esse elemento.

source: A simple end() example
pt_br: Exemplo simples de end()

source: ?php $fruits = array( 'apple' ,'banana' ,'cranberry'); print end($fruits); / / cranberry?
pt_br: ?php $frutas = array( 'melancia' ,'banana' ,'morango'); print end($frutas); / / morango?

source: See also current(), each(), next(), and reset().
pt_br: Veja também current(), each(), end(), next() e reset().

source: Example 1. ereg() Example
pt_br: Exemplo 1. ereg() Example

source: Example 1. eregi() example
pt_br: Exemplo 1. eregi() example

source: Example 1. ereg_replace() Example
pt_br: Exemplo 1. ereg_replace() Example
